app/controllers/authors_controller.rb

  def index
    # Where the index logic goes
    @authors = Author.all
    @author_posts = Post.all
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]